app/views/resenas/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
            <tr>
            <td><%= User.find(resena_recibida.usuario_creador_id).nombre %></td>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
                    <tr>
                    <td><%= User.find(resena_creada.usuario_receptor_id).nombre%></td>