app/views/solicituds/edit.html.erb

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <td><%= libro_usuario.descripcion %></td>
                <%@solicitud = Solicitud.find(params[:solicitud_id])%>