app/views/solicituds/index_pendientes.html.erb

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <td><%=info_solicitud_recibida[0] %></td>
                <%@solicitud = Solicitud.find(info_solicitud_recibida[5])%>