app/controllers/juegos_controller.rb

SELECT "juegos".* FROM "juegos" WHERE "juegos"."disponibilidad" = $1  [["disponibilidad", "Disponible"]]
---
  def index
    @juegos_disponibles = Juego.where(disponibilidad: "Disponible")

SELECT "juegos".* FROM "juegos" WHERE "juegos"."disponibilidad" = $1  [["disponibilidad", "Disponible"]]
---
  def index_sin_sesion
    @juegos_disponibles = Juego.where(disponibilidad: "Disponible")

SELECT "juegos".* FROM "juegos" WHERE "juegos"."disponibilidad" = $1 AND (estado ilike '%Nuevo%')  [["disponibilidad", "Disponible"]]
---
  def search
    if params[:nombre].present? && params[:estado].present?
      juegos_search = Juego.where(disponibilidad: "Disponible").where('nombre ilike ?',
                                                                      "%#{params[:nombre]}%").where('estado ilike ?', "%#{params[:estado]}%")

SELECT "juegos".* FROM "juegos" WHERE "juegos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @juego = Juego.find(params[:juego_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "juegos" ("nombre", "tipo", "estado", "cant_jugadores", "descripcion", "imagen", "user_id", "created_at", "updated_at", "disponibilidad") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.find(params[:user_id])
    @juego = Juego.new(juegos_params)
    @juego.user = @user
    if @juego.save

SELECT "juegos".* FROM "juegos" WHERE "juegos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @juego = Juego.find(params[:juego_id])

SELECT "juegos".* FROM "juegos" WHERE "juegos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @juego = Juego.find(params[:juego_id])

SELECT "juegos".* FROM "juegos" WHERE "juegos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @juego = Juego.find(params[:juego_id])

SELECT "juegos".* FROM "juegos" WHERE "juegos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE (usuario_receptor_id ='3')
---
  def mostrar
    @juego = Juego.find(params[:juego_id])
    @resenas_recibidas = Resena.where("usuario_receptor_id =?", params[:user_dueno_id])