app/controllers/libros_controller.rb

SELECT "libros".* FROM "libros" WHERE "libros"."disponibilidad" = $1  [["disponibilidad", "Disponible"]]
---
  def index
    @libros_disponibles = Libro.where(disponibilidad: "Disponible")

SELECT "libros".* FROM "libros" WHERE "libros"."disponibilidad" = $1  [["disponibilidad", "Disponible"]]
---
  def index_sin_sesion
    @libros_disponibles = Libro.where(disponibilidad: "Disponible")

SELECT "libros".* FROM "libros" WHERE "libros"."disponibilidad" = $1 AND (titulo ilike '%Friends%')  [["disponibilidad", "Disponible"]]
---
  def search
    if params[:titulo].present? && params[:estado].present?
      libros_search = Libro.where(disponibilidad: "Disponible").where('titulo ilike ?',
                                                                      "%#{params[:titulo]}%").where('estado ilike ?', "%#{params[:estado]}%")

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @libro = Libro.find(params[:libro_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "libros" ("titulo", "autor", "estado", "paginas", "edicion", "editorial", "tapa", "descripcion", "imagen", "user_id", "created_at", "updated_at", "disponibilidad") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @user = User.find(params[:user_id])
    @libro = Libro.new(libros_params)
    @libro.user = @user
    if @libro.save

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @libro = Libro.find(params[:libro_id])

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "libros" SET "estado" = $1, "descripcion" = $2, "updated_at" = $3 WHERE "libros"."id" = $4  [["estado", "Nuevo"], ["descripcion", "Libro clásico"], ["updated_at", "2023-11-29 17:11:45.639112"], ["id", 2]]
---
  def update
    @libro = Libro.find(params[:libro_id])
    if @libro.update(libros_params)

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "libros" WHERE "libros"."id" = $1  [["id", 1]]
---
  def destroy
    @libro = Libro.find(params[:libro_id])
    @libro.destroy

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "resenas".* FROM "resenas" WHERE (usuario_receptor_id ='3')
---
  def mostrar
    @libro = Libro.find(params[:libro_id])
    @resenas_recibidas = Resena.where("usuario_receptor_id =?", params[:user_dueno_id])