app/controllers/resenas_controller.rb

SELECT "resenas".* FROM "resenas" WHERE (usuario_receptor_id =3)
---
  def index
    @resenas_creadas = Resena.where("usuario_creador_id =?", current_user.id)

SELECT "resenas".* FROM "resenas" WHERE "resenas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @resena = Resena.find(params[:resena_id])
    @user_receptor = User.find(params[:user_receptor_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @resena = Resena.new
    @user_receptor = User.find(params[:user_receptor_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "resenas" ("calificacion", "comentario", "usuario_creador_id", "usuario_receptor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["calificacion", 1], ["comentario", "C"], ["usuario_creador_id", 1], ["usuario_receptor_id", 2], ["created_at", "2023-11-29 21:35:53.386953"], ["updated_at", "2023-11-29 21:35:53.386953"]]
---
  def create
    @resena = Resena.new(resenas_params)
    @user_receptor = User.find(params[:user_receptor_id])
    @user_creador = User.find(params[:user_creador_id])
    @resena.usuario_creador_id = @user_creador.id
    @resena.usuario_receptor_id = @user_receptor.id
    if @resena.save