app/controllers/solicituds_controller.rb

SELECT "solicituds".* FROM "solicituds"
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @solicitudes = Solicitud.all
    info_solicitudes = []
    for solicitud in @solicitudes do
      id_solicitud = solicitud.id
      estado_solicitud = solicitud.estado
      tipo_solicitado = solicitud.solicitable_type
      if tipo_solicitado == "Libro"
        prod_solicitado = Libro.find(solicitud.solicitable_id)
        nombre_solicitado = prod_solicitado.titulo
      else
        prod_solicitado = Juego.find(solicitud.solicitable_id)
        nombre_solicitado = prod_solicitado.nombre
      end
      user_prod_solicitado = prod_solicitado.user

      tipo_ofrecido = solicitud.ofreciable_type
      if tipo_ofrecido == "Libro"
        prod_ofrecido = Libro.find(solicitud.ofreciable_id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index_pendientes
    @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index_ar
    @user = User.find(params[:user_id])

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @solicitud = Solicitud.find(params[:solicitud_id])
    @tipo_solicitado = @solicitud.solicitable_type

    if @tipo_solicitado == "Libro"
      @producto_solicitado = Libro.find(@solicitud.solicitable_id)
      @nombre_solicitado = @producto_solicitado.titulo
    else
      @producto_solicitado = Juego.find(@solicitud.solicitable_id)
      @nombre_solicitado = @producto_solicitado.nombre
    end

    @user_solicitado = @producto_solicitado.user.nombre
    @tipo_ofrecido = @solicitud.ofreciable_type

    if @tipo_ofrecido == "Libro"
      @producto_ofrecido = Libro.find(@solicitud.ofreciable_id)

SELECT "libros".* FROM "libros" WHERE "libros"."user_id" = $1 AND (disponibilidad ='Disponible')  [["user_id", 1]]
SELECT "juegos".* FROM "juegos" WHERE "juegos"."user_id" = $1 AND (disponibilidad = 'Disponible')  [["user_id", 1]]
---
  def new_solicitado
    @user = current_user
    libros_propios = @user.libros
    juegos_propios = @user.juegos
    @libros_propios = libros_propios.where("disponibilidad ='Disponible'")
    @juegos_propios = juegos_propios.where("disponibilidad = 'Disponible'")

SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new_ofrecido
    @user = current_user
    @libros_propios = @user.libros
    @juegos_propios = @user.juegos
    @solicitable_id = params[:producto_solicitado_id]
    @solicitable_type = params[:solicitable_type]
    @ofreciable_id = params[:producto_ofrecido_id]
    @ofreciable_type = params[:ofreciable_type]

    if @ofreciable_type == "1"
      @ofreciable_type = "Libro"
    elsif @ofreciable_type == "2"
      @ofreciable_type = "Juego"
    end

    if @solicitable_type == "1"
      @solicitable_type = "Libro"
      @prod_solicitado = Libro.find(@solicitable_id)

INSERT INTO "solicituds" ("estado", "solicitable_type", "solicitable_id", "ofreciable_type", "ofreciable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = current_user
    @libros_propios = @user.libros
    @juegos_propios = @user.juegos
    @solicitable_id = params[:producto_solicitado_id]
    @solicitable_type = params[:solicitable_type]
    @ofreciable_id = params[:producto_ofrecido_id]
    @ofreciable_type = params[:ofreciable_type]
    @solicitud = Solicitud.new(solicitud_params)
    if @solicitud.save

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "libros".* FROM "libros" WHERE "libros"."user_id" = $1 AND (disponibilidad ='Disponible')  [["user_id", 2]]
SELECT "juegos".* FROM "juegos" WHERE "juegos"."user_id" = $1 AND (disponibilidad = 'Disponible')  [["user_id", 2]]
---
  def edit
    @solicitud = Solicitud.find(params[:solicitud_id])
    @user = current_user
    libros = @user.libros
    juegos = @user.juegos
    @libros_usuario = libros.where("disponibilidad ='Disponible'")
    @juegos_usuario = juegos.where("disponibilidad = 'Disponible'")

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "solicituds" SET "estado" = $1, "updated_at" = $2 WHERE "solicituds"."id" = $3  [["estado", "Aceptada"], ["updated_at", "2023-11-29 21:35:39.208218"], ["id", 1]]
---
  def update_ar
    @solicitud = Solicitud.find(params[:solicitud_id])
    if @solicitud.update(solicitud_params)

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_estado
    @solicitud = Solicitud.find(params[:solicitud_id])

SELECT "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update_solicitud
    @solicitud = Solicitud.find(params[:solicitud_id])