app/controllers/users_controller.rb

  def show
    if current_user.nil? == false
      @usuario = current_user
      @libros_publicados = @usuario.libros.count()
      @juegos_publicados = @usuario.juegos.count()
---
SELECT COUNT(*) FROM "libros" WHERE "libros"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "juegos" WHERE "juegos"."user_id" = $1  [["user_id", 1]]

  def destroy
    if current_user.nil? == false
      user = current_user
      juegos = user.juegos
      for juego in juegos do
        if juego.disponibilidad == "Disponible"

          juegos.destroy
        end
      end
      libros = user.libros
      for libro in libros do
        if libro.disponibilidad == "Disponible"
          libro.destroy
        end
      end
      resenas_creadas = Resena.where("usuario_creador_id =?", current_user.id)
      resenas_recibidas = Resena.where("usuario_receptor_id =?", current_user.id)
      for resena in resenas_creadas do
        resena.destroy
      end
      for resena in resenas_recibidas do
        resena.destroy
      end
      user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
DELETE FROM "libros" WHERE "libros"."id" = $1  [["id", 1]]
SELECT "resenas".* FROM "resenas" WHERE (usuario_receptor_id =1)
SELECT "resenas".* FROM "resenas" WHERE (usuario_creador_id =1)
DELETE FROM "resenas" WHERE "resenas"."id" = $1  [["id", 1]]